{
  "slug": "clop",
  "name": "clop",
  "uuid": null,
  "description": "The ransomware group known as Cl0p is a variant of a previously known strain dubbed CryptoMix. It is worth noting that this variant was delivered as the final payload in a phishing campaign in 2019 and was exclusively financially motivated, with attacks carried out by the threat actors TA505.<br> <br> At that time, malicious actors sent phishing emails that led to a macro-enabled document that would drop a loader called 'Get2.' After gaining an initial foothold in the system or infrastructure, the actors began using reconnaissance, lateral movement, and exfiltration techniques to prepare for the deployment of the ransomware.<br> <br> After the execution of the ransomware, Cl0p appends the extension '.clop' to the end of files, or other types of extensions such as '.CIIp, .Cllp, and .C_L_O_P,' as well as different versions of the ransom note that were also observed after encryption. Depending on the variant, any of the ransom text files were created with names like 'ClopReadMe.txt, README_README.txt, Cl0pReadMe.txt, and READ_ME_!!!.TXT.'<br> <br> The Clop operation has shifted from delivering its final payload via phishing and has begun initiating attacks using vulnerabilities that resulted in the exploitation and infection of victims' infrastructures.<BR>Source: https://github.com/crocodyli/ThreatActors-TTPs",
  "aliases": [],
  "refs": [
    "http://ekbgzchl6x2ias37.onion/",
    "http://santat7kpllt6iyvqbr7q4amdv6dzrh6paatvyrzl7ry3zm72zigf4ad.onion/",
    "http://toznnag5o3ambca56s2yacteu7q7x2avrfherzmz4nmujrjuib4iusad.onion/"
  ],
  "country": null,
  "countries": null,
  "sectors": null,
  "related": [],
  "rawMeta": {
    "sources": [
      "RWLive"
    ],
    "description_sources": [
      "RWLive"
    ],
    "external_ids": null,
    "entity_type": "intrusion-set",
    "ttp_mappings": [
      "T1566.001",
      "T1190",
      "T1078",
      "T1106",
      "T1059",
      "T1204",
      "T1547",
      "T1543.003",
      "T1484.001",
      "T1068",
      "T1574",
      "T1036.001",
      "T1562.001",
      "T1140",
      "T1070.004",
      "T1055.001",
      "T1202",
      "T1070.001",
      "T1083",
      "T1018",
      "T1057",
      "T1082",
      "T1012",
      "T1063",
      "T1570",
      "T1021.002",
      "T1005",
      "T1071",
      "T1567",
      "T1486",
      "T1490"
    ]
  },
  "order": 0
}
