{
  "slug": "lockbit",
  "name": "LockBit Ransomware Actors & Affiliates",
  "uuid": null,
  "description": "This object represents the LockBit Ransomware-as-a-Service (\"RaaS\") apex group and the behaviors associated with its various affiliate ransomware operators. Specific affiliate operations defined by the research community will be tracked as separate objects.\n\nRansomware labeled \"LockBit\" was first observed in 2020. LockBit developers have introduced multiple versions of the LockBit encryption tool. According to the U.S. Cybersecurity and Infrastructure Security Agency (\"CISA\"), the following major LockBit variants have been observed (first-observed dates in parentheses): ABCD (LockBit malware's predecessor; September 2019), LockBit (January 2020), LockBit 2.0 (June 2021), LockBit Linux-ESXi Locker (October 2021), LockBit 3.0 (March 2022), LockBit Green (a variant that incorporates source code from Conti ransomware; January 2023), and variants capable of targeting macOS environments (April 2023). As of June 2023, CISA reported that the web panel that offers affiliates access to LockBit malware explicitly listed the LockBit 2.0, LockBit 3.0, LockBit Green, and LockBit Linux-ESXi Locker variants.<sup>[[U.S. CISA Understanding LockBit June 2023](/references/9c03b801-2ebe-4c7b-aa29-1b7a3625964a)]</sup>\n\nSince emerging in 2020, the LockBit group and its affiliates have carried out a very large number of attacks involving a wide range of victims around the world. In June 2023, the U.S. Federal Bureau of Investigation reported it had identified 1,700 LockBit attacks since 2020.<sup>[[U.S. CISA Understanding LockBit June 2023](/references/9c03b801-2ebe-4c7b-aa29-1b7a3625964a)]</sup> According to data collected by the [ransomwatch project](https://github.com/joshhighet/ransomwatch) and analyzed by Tidal, LockBit actors publicly claimed 970 victims in 2022 (576 associated with the LockBit 2.0 variant and 394 associated with LockBit 3.0), the most of any extortion threat that year. Through April 2023, LockBit had claimed 406 victims, more than double the number of the next threat (Clop, with 179 victims).<sup>[[GitHub ransomwatch](/references/62037959-58e4-475a-bb91-ff360d20c1d7)]</sup> CISA reported in June 2023 that U.S. ransoms paid to LockBit since January 2020 totaled $91 million.<sup>[[U.S. CISA Understanding LockBit June 2023](/references/9c03b801-2ebe-4c7b-aa29-1b7a3625964a)]</sup>\n\nLockBit affiliate operators are known to use a wide variety of techniques during their attacks. Initial access for LockBit infections has occurred via most methods (including a number of vulnerability exploits), and operators are known to abuse a range of free and open-source software tools for a variety of post-exploitation activities. In addition to victim data encryption, LockBit actors routinely exfiltrate victim data and threaten to leak this data for extortion purposes.\n\n**Related Vulnerabilities**: CVE-2021-22986, CVE-2023-0669, CVE-2023-27350, CVE-2021-44228, CVE-2021-22986, CVE-2020-1472, CVE-2019-0708, CVE-2018-13379<sup>[[U.S. CISA Understanding LockBit June 2023](/references/9c03b801-2ebe-4c7b-aa29-1b7a3625964a)]</sup>",
  "aliases": [
    "**LockBit**"
  ],
  "refs": [
    "http://lockbitkodidilol.onion/",
    "https://github.com/crocodyli/Ransomwares-TTP/assets/113185400/cef50066-b2ca-4283-b10a-00f97a134d1a"
  ],
  "country": null,
  "countries": null,
  "sectors": null,
  "related": [],
  "rawMeta": {
    "sources": [
      "MISP:tidal",
      "MITRE:G3013",
      "RWLive",
      "TA-TTPs"
    ],
    "description_sources": [
      "MISP:tidal"
    ],
    "external_ids": {
      "mitre": "G3013"
    },
    "entity_type": "intrusion-set",
    "ttp_mappings": [
      "T1018",
      "T1021.002",
      "T1041",
      "T1047",
      "T1057",
      "T1071.001",
      "T1078.001",
      "T1082",
      "T1083",
      "T1106",
      "T1120",
      "T1134.001",
      "T1135",
      "T1485",
      "T1486",
      "T1491.001",
      "T1547.001",
      "T1559.001",
      "T1562.001",
      "T1562.002",
      "T1562.004",
      "T1562.009",
      "T1573"
    ]
  },
  "order": 0
}
