{
  "slug": "medusa-group",
  "name": "Medusa Group",
  "uuid": null,
  "description": "[Medusa Group](https://attack.mitre.org/groups/G1051) has been active since at least 2021 and was initially operated as a closed ransomware group before evolving into a Ransomware-as-a-Service (RaaS) operation. Some reporting indicates that certain attacks may still be conducted directly by the ransomware’s core developers. Public sources have also referred to the group as “Spearwing” or “Medusa Actors.” (Citation: CISA Medusa Group Medusa Ransomware March 2025) (Citation: Broadcom Medusa Ransomware Medusa Group March 2025) [Medusa Group](https://attack.mitre.org/groups/G1051) employs living-off-the-land techniques, frequently leveraging publicly available tools and common remote management software to conduct operations. The group engages in double extortion tactics, exfiltrating data prior to encryption and threatening to publish stolen information if ransom demands are not met. (Citation: Security Scorecard Medusa Ransomware January 2024) For initial access, [Medusa Group](https://attack.mitre.org/groups/G1051) has exploited publicly known vulnerabilities, conducted phishing campaigns, and used credentials or access purchased from Initial Access Brokers (IABs). The group is opportunistic and has targeted a wide range of sectors globally. (Citation: Intel471 Medusa Ransomware May 2025)",
  "aliases": [
    "Medusa Group"
  ],
  "refs": [
    "https://attack.mitre.org/groups/G1051",
    "https://www.cisa.gov/news-events/cybersecurity-advisories/aa25-071a",
    "https://www.intel471.com/blog/threat-hunting-case-study-medusa-ransomware",
    "https://www.security.com/threat-intelligence/medusa-ransomware-attacks",
    "https://securityscorecard.com/wp-content/uploads/2024/01/deep-dive-into-medusa-ransomware.pdf"
  ],
  "country": null,
  "countries": null,
  "sectors": null,
  "first_seen": null,
  "last_seen": null,
  "related": [],
  "rawMeta": {
    "sources": [
      "MITRE"
    ],
    "description_sources": [
      "MITRE"
    ],
    "external_ids": {
      "mitre": "G1051"
    },
    "entity_type": "intrusion-set",
    "ttp_mappings": []
  },
  "order": 0
}
