{
  "slug": "unc3973",
  "name": "UNC3973",
  "uuid": null,
  "description": "UNC3973 is a financially motivated threat actor tracked by Mandiant, distinguished from the broader BASTA ransomware ecosystem (primarily tracked as UNC4393) due to its unique operational characteristics and TTPs. This actor has demonstrated a specific focus on supply chain compromises, as evidenced by their June campaign targeting credit unions in western Canada via a compromised managed service provider (MSP). UNC3973 leverages unauthorized service accounts with elevated privileges, specifically domain administrator accounts shared between the compromised MSP and the target organizations, to gain initial access.This actor's post-exploitation activity includes attempts to disable security controls and deploy the SYSTEMBC tunneler for command and control (C2) communication, followed by attempts to deploy BASTA ransomware. While their attempts to deploy both SYSTEMBC and BASTA have been observed, these were thankfully thwarted by endpoint security solutions in observed instances. The targeted, supply chain-enabled nature of UNC3973's intrusions, coupled with its use of privileged shared accounts and attempts at deploying BASTA, all suggest that it is an exclusive group, perhaps even affiliates working closely with or possibly operating under the direct control, BASTA ransomware operators. This group's ability to exploit centralized access points, like MSPs, represents a significant threat to organizations reliant on third-party providers.",
  "aliases": [],
  "refs": [
    "https://services.google.com/fh/files/misc/m_trends_2023_report.pdf",
    "https://cloud.google.com/blog/topics/threat-intelligence/unc4393-goes-gently-into-silentnight"
  ],
  "country": null,
  "countries": null,
  "sectors": null,
  "related": [],
  "rawMeta": {
    "sources": [
      "MISP:threat-actor"
    ],
    "description_sources": [
      "MISP:threat-actor"
    ],
    "external_ids": null,
    "entity_type": "intrusion-set",
    "ttp_mappings": []
  },
  "order": 0
}
